letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
void show_pads()
{
    int r = 3;

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        bool gp1 = mcp->getLevel(MCP_GPIO_1) == MCP_LOGIC_LEVEL::HIGH;
        bool gp2 = mcp->getLevel(MCP_GPIO_2) == MCP_LOGIC_LEVEL::HIGH;
        bool gp3 = mcp->getLevel(MCP_GPIO_3) == MCP_LOGIC_LEVEL::HIGH;
        bool gp4 = mcp->getLevel(MCP_GPIO_4) == MCP_LOGIC_LEVEL::HIGH;

        ssd->fill(0x00);
        ssd->drawCircle(8, 41, r, true, 0xFF);
        ssd->drawCircle(14, 30, r, gp3, 0xFF);
        ssd->drawCircle(22, 20, r, gp4, 0xFF);
        ssd->drawCircle(32, 13, r, false, 0xFF);
        ssd->drawChar('G', 30, 10, 0xFF);
        ssd->drawChar('V', 6, 38, 0x00);

        ssd->drawCircle(119, 41, r, true, 0xFF);
        ssd->drawCircle(113, 30, r, gp2, 0xFF);
        ssd->drawCircle(105, 20, r, gp1, 0xFF);
        ssd->drawCircle(95, 13, r, false, 0xFF);
        ssd->drawChar('G', 93, 10, 0xFF);
        ssd->drawChar('V', 117, 38, 0x00);

        ssd->drawChar(gp3 ? '1' : '0', 12, 27, gp3 ? 0x00 : 0xFF);
        ssd->drawChar(gp4 ? '1' : '0', 20, 17, gp4 ? 0x00 : 0xFF);
        ssd->drawChar(gp2 ? '1' : '0', 111, 27, gp2 ? 0x00 : 0xFF);
        ssd->drawChar(gp1 ? '1' : '0', 103, 17, gp1 ? 0x00 : 0xFF);

        ssd->show();

        fiber_sleep(10);
    }
}

void show_jacdac()
{
    // ssd->fill(0x00);
    // ssd->drawText("  Serial output...", 5, 60, 0xFF);
    // ssd->show();

    ssd->fill(0x00);
    ssd->drawText("  Not available...", 5, 60, 0xFF);
    ssd->show();

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        // int rec = jacdac->getc();
        // while (rec > 0) {
        //     printf("%c", char(rec));
        //     rec = jacdac->getc();
        // }

        fiber_sleep(1);
    }
}
void show_qwic()
{
    ssd->fill(0x00);
    ssd->drawText("  Not available...", 5, 60, 0xFF);
    ssd->show();

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        fiber_sleep(1);
    }
}

void Demo_main(codal::STM32STEAM32_WB55RG& steam32)
{
    spi     = &steam32.spi1;
    cs      = &steam32.io.PD_0;
    dc      = &steam32.io.PB_4;
    rst     = &steam32.io.PA_12;
    ssd     = new SSD1327_SPI(*spi, *cs, *dc, *rst, 128, 128);
    btnMenu = &steam32.io.PA_0;
    btnA    = &steam32.io.PA_7;
    btnB    = &steam32.io.PA_8;
    buzzer  = &steam32.io.PA_11;

    led_red   = &steam32.io.PC_12;
    led_green = &steam32.io.PC_11;
    led_blue  = &steam32.io.PC_10;

    buzzer->setAnalogValue(0);

    steam32.serial.init(115200);
    steam32.sleep(500);

    printf("Init peripherals !\r\n");

    ssd->init();
    ssd->fill(0x00);
    ssd->drawText("Initialization...", 20, 60, 0xFF);
    ssd->show();

    mcp  = new MCP23009E(steam32.i2c1, 0x40, steam32.io.PB_1, steam32.io.PB_0);
    hts  = new HTS221(&steam32.i2c1, 0xBE);
    pres = new WSEN_PADS(steam32.i2c1, 0xBA);
    apds = new APDS9960(steam32.i2c1, 0x72);
    tof  = new VL53L1X(&steam32.i2c1);
    ism  = new ISM330DL(&steam32.i2c1);
    lis  = new LIS2MDL(&steam32.i2c1);
    sai  = new STM32SAI(&steam32.io.PA_10, &steam32.io.PA_3, GPIO_AF3_SAI1, AUDIO_BUFFER);
    // jacdac = new STM32SingleWireSerial(steam32.io.PB_6);
    rtc = new STM32RTC();

    mcp->setup(MCP_GPIO_1, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_2, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_3, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_4, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GP_RIGHT, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_BOTTOM, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_LEFT, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_UP, MCP_DIR::INPUT);

    hts->init();
    hts->setOutputRate(codal::HTS221_OUTPUT_RATE::RATE_7HZ);

    pres->init();

    tof->init();

    ism->init();
    ism->setAccelerometerODR(ISM_ODR::F_1_66_KHZ);
    ism->setGyroscopeODR(ISM_ODR::F_208_HZ);

    lis->init();
    lis->setODR(LIS2_ODR::F_50_HZ);
    lis->setLowPassFilter(true);

    apds->init();

    if (!sai->init()) {
        printf("Failed to init SAI\r\n");
    }
    sai->onReceiveData(micro_on_data);

    // jacdac->init(1000000);

    rtc->init();

    steam32.sleep(500);

    ssd->fill(0x00);
    ssd->drawText("Hello STeamy !", 20, 60, 0xFF);
    ssd->show();
    printf("Hello STeamy !\r\n");
    steam32.sleep(1500);

    vector<MenuEntry> mainMenuEntries = {{"Temp & Hum", []() -> void { show_temp_hum(); }},
                                         {"Pressure", []() -> void { show_pressure(); }},
                                         {"Time Of Flight", []() -> void { show_tof(); }},
                                         {"Acc / Gyro / Magn", []() -> void { show_acc_gyro_magn(); }},
                                         {"Color Sensor", []() -> void { show_optical_sensor(); }},
                                         {"Microphone", []() -> void { show_microphone(); }},
                                         {"RTC", []() -> void { show_rtc(); }},
                                         {"Buzzer", []() -> void { show_buzzer(); }},
                                         {"Buttons", []() -> void { show_button(); }},
                                         {"LEDs", []() -> void { show_rgb(); }},
                                         {"Screen", []() -> void { show_screen(); }},
                                         {"Battery", []() -> void { show_battery(); }},
                                         {"Pads \"tete\"", []() -> void { show_pads(); }},
                                         {"(QWIC)", []() -> void { show_qwic(); }},
                                         {"(jacdac)", []() -> void { show_jacdac(); }}};
    mainMenu                          = new ScreenMenu(*ssd, mainMenuEntries);

    while (1) {
        show_main_menu();
    }
}